leandroschwarz/funsapeLib/_stuff/loose_files/(UTIL)[CHECK]sdCardOtherFiles/stm32_adafruit_sd (26).c
/* Private function prototypes -----------------------------------------------*/
static uint8_t SD_GetCIDRegister(SD_CID* Cid);
static uint8_t SD_GetCSDRegister(SD_CSD* Csd);
static uint8_t SD_GetDataResponse(void);
static uint8_t SD_GoIdleState(void);
static SD_CmdAnswer_typedef SD_SendCmd(uint8_t Cmd, uint32_t Arg, uint8_t Crc, uint8_t Answer);
static uint8_t SD_WaitData(uint8_t data);
static uint8_t SD_ReadData(void);
/** @defgroup STM32_ADAFRUIT_SD_Private_Function_Prototypes
  * @{
  */
/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/

/** @defgroup STM32_ADAFRUIT_SD_Private_Functions
  * @{
  */

/**
  * @brief  Initializes the SD/SD communication.
  * @param  None
  * @retval The SD Response:
  *         - MSD_ERROR: Sequence failed
  *         - MSD_OK: Sequence succeed
  */
uint8_t BSP_SD_Init(void)
{
	/* Configure IO functionalities for SD pin */
	SD_IO_Init();

	/* SD detection pin is not physically mapped on the Adafruit shield */
	SdStatus = SD_PRESENT;

	/* SD initialized and set to SPI mode properly */
	return SD_GoIdleState();
}

/**
  * @brief  Returns information about specific card.
  * @param  pCardInfo: Pointer to a SD_CardInfo structure that contains all SD
  *         card information.
  * @retval The SD Response:
  *         - MSD_ERROR: Sequence failed
  *         - MSD_OK: Sequence succeed
  */
uint8_t BSP_SD_GetCardInfo(SD_CardInfo *pCardInfo)
{
	uint8_t status;

	status = SD_GetCSDRegister(&(pCardInfo->Csd));
	status |= SD_GetCIDRegister(&(pCardInfo->Cid));
	if (flag_SDHC == 1 ) {
		pCardInfo->CardBlockSize = 512;
		pCardInfo->CardCapacity = (pCardInfo->Csd.version.v2.DeviceSize + 1) * pCardInfo->CardBlockSize;
	} else {
		pCardInfo->CardCapacity = (pCardInfo->Csd.version.v1.DeviceSize + 1) ;
		pCardInfo->CardCapacity *= (1 << (pCardInfo->Csd.version.v1.DeviceSizeMul + 2));
		pCardInfo->CardBlockSize = 1 << (pCardInfo->Csd.RdBlockLen);
		pCardInfo->CardCapacity *= pCardInfo->CardBlockSize;
	}

	return status;
}

/**
  * @brief  Reads block(s) from a specified address in the SD card, in polling mode.
  * @param  pData: Pointer to the buffer that will contain the data to transmit
  * @param  ReadAddr: Address from where data is to be read
  * @param  BlockSize: SD card data block size, that should be 512
  * @param  NumOfBlocks: Number of SD blocks to read
  * @retval SD status
  */
uint8_t BSP_SD_ReadBlocks(uint32_t* pData, uint32_t ReadAddr, uint16_t BlockSize, uint32_t NumberOfBlocks)
{
	uint32_t offset = 0;
	uint8_t retr = BSP_SD_ERROR;
	uint8_t *ptr = NULL;
	SD_CmdAnswer_typedef response;

	/* Send CMD16 (SD_CMD_SET_BLOCKLEN) to set the size of the block and
	   Check if the SD acknowledged the set block length command: R1 response (0x00: no errors) */
	response = SD_SendCmd(SD_CMD_SET_BLOCKLEN, BlockSize, 0xFF, SD_ANSWER_R1_EXPECTED);
	SD_IO_CSState(1);
	SD_IO_WriteByte(SD_DUMMY_BYTE);
	if ( response.r1 != SD_R1_NO_ERROR) {
		goto error;
	}

	ptr = malloc(sizeof(uint8_t) * BlockSize);
	if ( ptr == NULL ) {
		goto error;
	}
	memset(ptr, SD_DUMMY_BYTE, sizeof(uint8_t)*BlockSize);

	/* Data transfer */
	while (NumberOfBlocks--) {
		/* Send CMD17 (SD_CMD_READ_SINGLE_BLOCK) to read one block */
		/* Check if the SD acknowledged the read block command: R1 response (0x00: no errors) */
		response = SD_SendCmd(SD_CMD_READ_SINGLE_BLOCK, (ReadAddr + offset) / (flag_SDHC == 1 ? BlockSize : 1), 0xFF, SD_ANSWER_R1_EXPECTED);
		if ( response.r1 != SD_R1_NO_ERROR) {
			goto error;
		}

		/* Now look for the data token to signify the start of the data */
		if (SD_WaitData(SD_TOKEN_START_DATA_SINGLE_BLOCK_READ) == BSP_SD_OK) {
			/* Read the SD block data : read NumByteToRead data */
			SD_IO_WriteReadData(ptr, (uint8_t*)pData + offset, BlockSize);

			/* Set next read address*/
			offset += BlockSize;
			/* get CRC bytes (not really needed by us, but required by SD) */
			SD_IO_WriteByte(SD_DUMMY_BYTE);
			SD_IO_WriteByte(SD_DUMMY_BYTE);
		} else {
			goto error;
		}

		/* End the command data read cycle */
		SD_IO_CSState(1);
		SD_IO_WriteByte(SD_DUMMY_BYTE);
	}

	retr = BSP_SD_OK;

error :
	/* Send dummy byte: 8 Clock pulses of delay */
	SD_IO_CSState(1);
	SD_IO_WriteByte(SD_DUMMY_BYTE);
	if (ptr != NULL) { free(ptr); }

	/* Return the reponse */
	return retr;
}

/**
  * @brief  Writes block(s) to a specified address in the SD card, in polling mode.
  * @param  pData: Pointer to the buffer that will contain the data to transmit
  * @param  WriteAddr: Address from where data is to be written
  * @param  BlockSize: SD card data block size, that should be 512
  * @param  NumOfBlocks: Number of SD blocks to write
  * @retval SD status
  */
uint8_t BSP_SD_WriteBlocks(uint32_t* pData, uint32_t WriteAddr, uint16_t BlockSize, uint32_t NumberOfBlocks)
{
	uint32_t offset = 0;
	uint8_t retr = BSP_SD_ERROR;
	uint8_t *ptr = NULL;
	SD_CmdAnswer_typedef response;

	/* Send CMD16 (SD_CMD_SET_BLOCKLEN) to set the size of the block and
	   Check if the SD acknowledged the set block length command: R1 response (0x00: no errors) */
	response = SD_SendCmd(SD_CMD_SET_BLOCKLEN, BlockSize, 0xFF, SD_ANSWER_R1_EXPECTED);
	SD_IO_CSState(1);
	SD_IO_WriteByte(SD_DUMMY_BYTE);
	if ( response.r1 != SD_R1_NO_ERROR) {
		goto error;
	}

	ptr = malloc(sizeof(uint8_t) * BlockSize);
	if (ptr == NULL) {
		goto error;
	}

	/* Data transfer */
	while (NumberOfBlocks--) {
		/* Send CMD24 (SD_CMD_WRITE_SINGLE_BLOCK) to write blocks  and
		   Check if the SD acknowledged the write block command: R1 response (0x00: no errors) */
		response = SD_SendCmd(SD_CMD_WRITE_SINGLE_BLOCK, (WriteAddr + offset) / (flag_SDHC == 1 ? BlockSize : 1), 0xFF, SD_ANSWER_R1_EXPECTED);
		if (response.r1 != SD_R1_NO_ERROR) {
			goto error;
		}

		/* Send dummy byte for NWR timing : one byte between CMDWRITE and TOKEN */
		SD_IO_WriteByte(SD_DUMMY_BYTE);
		SD_IO_WriteByte(SD_DUMMY_BYTE);

		/* Send the data token to signify the start of the data */
		SD_IO_WriteByte(SD_TOKEN_START_DATA_SINGLE_BLOCK_WRITE);

		/* Write the block data to SD */
		SD_IO_WriteReadData((uint8_t*)pData + offset, ptr, BlockSize);

		/* Set next write address */
		offset += BlockSize;

